In [34]:
import pandas as pd

In [35]:
# gerando dados
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [36]:
#Listando numeros
list('321')

['3', '2', '1']

In [37]:
#Criando DF utilizando numeros e letras
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [38]:
#Ordenando o dataframe pelo indice
df.sort_index(inplace = True)

In [39]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [40]:
#Ordenando o dataframe pelo indice e modificando a visialização das colunas
df.sort_index(inplace = True, axis = 1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [41]:
#Ordena os valores levando em consideração 1 variável
df.sort_values(by = 'X', inplace = True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [43]:
df.sort_values(by = '3', axis = 1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [55]:
df.sort_index(axis = 1)

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7